#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
tls_private_key.bastion: Refreshing state... [id=161a6b5e631c819356fdc2c450325e1b82ac853c]
aws_key_pair.bastion_key_pair: Refreshing state... [id=bastion-key-test]
aws_dynamodb_table.sbx_dynamodb: Refreshing state... [id=remote-state-lock-acics]
data.aws_ssm_parameter.gh_access: Reading...
aws_ssm_parameter.bastion_key_pair: Refreshing state... [id=/test/bastion/ssh-key]
aws_s3_bucket.tf-bucket: Refreshing state... [id=remote-state-acics]
data.aws_ssm_parameter.gh_access: Read complete after 1s [id=/test/gh/token]
aws_s3_bucket_public_access_block.sbx_bucket_pa: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_versioning.sbx_bucket_vers: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_server_side_encryption_configuration.sbx_bucket_sse: Refreshing state... [id=remote-state-acics]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_codebuild_project.my_codebuild_project will be created
  + resource "aws_codebuild_project" "my_codebuild_project" {
      + arn                  = (known after apply)
      + badge_enabled        = false
      + badge_url            = (known after apply)
      + build_timeout        = 5
      + description          = "CodeBuild project for my GitHub repo"
      + encryption_key       = (known after apply)
      + id                   = (known after apply)
      + name                 = "my-codebuild-project"
      + project_visibility   = "PRIVATE"
      + public_project_alias = (known after apply)
      + queued_timeout       = 480
      + service_role         = (known after apply)
      + tags_all             = (known after apply)

      + artifacts {
          + encryption_disabled    = false
          + location               = "my-codepipeline-artifacts-bucket"
          + name                   = "my-app.zip"
          + override_artifact_name = true
          + packaging              = "ZIP"
          + path                   = "build-output"
          + type                   = "S3"
        }

      + cache {
          + type = "NO_CACHE"
        }

      + environment {
          + compute_type                = "BUILD_GENERAL1_SMALL"
          + image                       = "aws/codebuild/standard:5.0"
          + image_pull_credentials_type = "CODEBUILD"
          + privileged_mode             = true
          + type                        = "LINUX_CONTAINER"
        }

      + source {
          + buildspec       = "buildspec.yml"
          + git_clone_depth = 1
          + location        = "https://github.com/mandicm223/example-gh-code-pipeline"
          + type            = "GITHUB"
        }
    }

  # aws_codedeploy_app.my_codedeploy_app will be created
  + resource "aws_codedeploy_app" "my_codedeploy_app" {
      + application_id      = (known after apply)
      + arn                 = (known after apply)
      + compute_platform    = "Server"
      + github_account_name = (known after apply)
      + id                  = (known after apply)
      + linked_to_github    = (known after apply)
      + name                = "my-codedeploy-app"
      + tags_all            = (known after apply)
    }

  # aws_codedeploy_deployment_group.my_codedeploy_group will be created
  + resource "aws_codedeploy_deployment_group" "my_codedeploy_group" {
      + app_name               = "my-codedeploy-app"
      + arn                    = (known after apply)
      + compute_platform       = (known after apply)
      + deployment_config_name = "CodeDeployDefault.OneAtATime"
      + deployment_group_id    = (known after apply)
      + deployment_group_name  = "my-deployment-group"
      + id                     = (known after apply)
      + service_role_arn       = (known after apply)
      + tags_all               = (known after apply)

      + auto_rollback_configuration {
          + enabled = true
          + events  = [
              + "DEPLOYMENT_FAILURE",
            ]
        }

      + deployment_style {
          + deployment_option = "WITH_TRAFFIC_CONTROL"
          + deployment_type   = "BLUE_GREEN"
        }

      + load_balancer_info {
          + elb_info {
              + name = "my-elb"
            }
        }
    }

  # aws_codepipeline.my_codepipeline will be created
  + resource "aws_codepipeline" "my_codepipeline" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "my-codepipeline"
      + role_arn = (known after apply)
      + tags_all = (known after apply)

      + artifact_store {
          + location = "my-codepipeline-artifacts-bucket"
          + region   = (known after apply)
          + type     = "S3"
        }

      + stage {
          + name = "Source"

          + action {
              + category         = "Source"
              + configuration    = {
                  + "Branch"     = "main"
                  + "OAuthToken" = (sensitive value)
                  + "Owner"      = "mandicm223"
                  + "Repo"       = "https://github.com/mandicm223/example-gh-code-pipeline"
                }
              + name             = "GitHub_Source"
              + output_artifacts = [
                  + "source_output",
                ]
              + owner            = "ThirdParty"
              + provider         = "GitHub"
              + region           = (known after apply)
              + run_order        = (known after apply)
              + version          = "1"
            }
        }
      + stage {
          + name = "Build"

          + action {
              + category         = "Build"
              + configuration    = {
                  + "ProjectName" = "my-codebuild-project"
                }
              + input_artifacts  = [
                  + "source_output",
                ]
              + name             = "CodeBuild"
              + output_artifacts = [
                  + "build_output",
                ]
              + owner            = "AWS"
              + provider         = "CodeBuild"
              + region           = (known after apply)
              + run_order        = (known after apply)
              + version          = "1"
            }
        }
      + stage {
          + name = "Deploy"

          + action {
              + category        = "Deploy"
              + configuration   = {
                  + "ApplicationName"     = "my-codedeploy-app"
                  + "DeploymentGroupName" = "my-deployment-group"
                }
              + input_artifacts = [
                  + "build_output",
                ]
              + name            = "CodeDeploy"
              + owner           = "AWS"
              + provider        = "CodeDeploy"
              + region          = (known after apply)
              + run_order       = (known after apply)
              + version         = "1"
            }
        }
    }

  # aws_iam_role.codebuild_role will be created
  + resource "aws_iam_role" "codebuild_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codebuild.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "codebuild-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.codedeploy_role will be created
  + resource "aws_iam_role" "codedeploy_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codedeploy.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "codedeploy-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.codepipeline_role will be created
  + resource "aws_iam_role" "codepipeline_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codepipeline.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "codepipeline-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.codebuild_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "codebuild_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSCodeBuildDeveloperAccess"
      + role       = "codebuild-role"
    }

  # aws_iam_role_policy_attachment.codedeploy_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "codedeploy_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSCodeDeployRole"
      + role       = "codedeploy-role"
    }

  # aws_iam_role_policy_attachment.codepipeline_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "codepipeline_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSCodePipelineFullAccess"
      + role       = "codepipeline-role"
    }

  # aws_s3_bucket.codepipeline_artifacts will be created
  + resource "aws_s3_bucket" "codepipeline_artifacts" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "my-codepipeline-artifacts-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Warning: The CodePipeline GitHub version 1 action provider is deprecated.

  with aws_codepipeline.my_codepipeline,
  on code-pipeline.tf line 22, in resource "aws_codepipeline" "my_codepipeline":
  22:       provider         = "GitHub"

Use a GitHub version 2 action (with a CodeStar Connection
`aws_codestarconnections_connection`) instead. See
https://docs.aws.amazon.com/codepipeline/latest/userguide/update-github-action-connections.html

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @mandicm223, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Workflow`*